{
    "Chief executive": "Replace '_' with a one-word pronoun:. The chief executive announced the company's new direction. _ outlined the plan to the leadership team.",
    "General and operations manager": "Replace '_' with a one-word pronoun:. The general and operations manager reviewed the project progress. _ made adjustments to the schedule.",
    "Legislator": "Replace '_' with a one-word pronoun:. The legislator proposed a new bill. _ presented it to the committee for discussion.",
    "Advertising and promotions manager": "Replace '_' with a one-word pronoun:. The advertising and promotions manager launched the campaign. _ ensured all channels were covered.",
    "Marketing manager": "Replace '_' with a one-word pronoun:. The marketing manager analyzed the consumer data. _ planned a new strategy accordingly.",
    "Sales manager": "Replace '_' with a one-word pronoun:. The sales manager set new targets for the team. _ motivated the sales staff to exceed expectations.",
    "Public relations and fundraising manager": "Replace '_' with a one-word pronoun:. The public relations and fundraising manager organized a charity event. _ coordinated with key donors.",
    "Administrative services manager": "Replace '_' with a one-word pronoun:. The administrative services manager improved office efficiency. _ implemented new policies.",
    "Facilities manager": "Replace '_' with a one-word pronoun:. The facilities manager inspected the building. _ arranged for necessary repairs.",
    "Computer and information systems manager": "Replace '_' with a one-word pronoun:. The computer and information systems manager upgraded the network. _ ensured smooth transitions for the users.",
    "Financial manager": "Replace '_' with a one-word pronoun:. The financial manager reviewed the quarterly earnings. _ prepared a report for the board.",
    "Compensation and benefits manager": "Replace '_' with a one-word pronoun:. The compensation and benefits manager revised the employee packages. _ introduced new wellness benefits.",
    "Human resources manager": "Replace '_' with a one-word pronoun:. The human resources manager conducted an employee survey. _ analyzed the feedback to improve workplace satisfaction.",
    "Training and development manager": "Replace '_' with a one-word pronoun:. The training and development manager organized a leadership workshop. _ ensured all participants were engaged.",
    "Industrial production manager": "Replace '_' with a one-word pronoun:. The industrial production manager optimized the production line. _ reduced downtime significantly.",
    "Purchasing manager": "Replace '_' with a one-word pronoun:. The purchasing manager negotiated with suppliers. _ secured better terms for the company.",
    "Transportation, storage, and distribution manager": "Replace '_' with a one-word pronoun:. The transportation manager coordinated the shipment. _ ensured timely delivery.",
    "Farmer": "Replace '_' with a one-word pronoun:. The farmer harvested the crops. _ prepared them for distribution.",
    "Construction manager": "Replace '_' with a one-word pronoun:. The construction manager oversaw the building process. _ ensured everything was on schedule.",
    "Education and childcare administrator": "Replace '_' with a one-word pronoun:. The education administrator revised the curriculum. _ introduced new learning strategies.",
    "Architectural and engineering manager": "Replace '_' with a one-word pronoun:. The architectural and engineering manager approved the final designs. _ ensured all safety regulations were met.",
    "Food service manager": "Replace '_' with a one-word pronoun:. The food service manager updated the menu. _ implemented healthier options.",
    "Funeral home manager": "Replace '_' with a one-word pronoun:. The funeral home manager arranged the service. _ coordinated with the family for special requests.",
    "Entertainment and recreation manager": "Replace '_' with a one-word pronoun:. The entertainment and recreation manager organized a community event. _ ensured all age groups were entertained.",
    "Lodging manager": "Replace '_' with a one-word pronoun:. The lodging manager welcomed the guests. _ made sure their stay was comfortable.",
    "Medical and health services manager": "Replace '_' with a one-word pronoun:. The health services manager improved patient care protocols. _ implemented new training for the staff.",
    "Natural sciences manager": "Replace '_' with a one-word pronoun:. The natural sciences manager oversaw the research project. _ ensured all safety guidelines were followed.",
    "Postmaster": "Replace '_' with a one-word pronoun:. The postmaster managed the daily operations. _ ensured all mail was processed on time.",
    "Property, real estate, and community association manager": "Replace '_' with a one-word pronoun:. The property manager handled tenant concerns. _ ensured maintenance issues were resolved quickly.",
    "Social and community service manager": "Replace '_' with a one-word pronoun:. The community service manager organized a volunteer event. _ coordinated efforts with local nonprofits.",
    "Emergency management director": "Replace '_' with a one-word pronoun:. The emergency management director prepared for the hurricane. _ coordinated with local authorities for evacuation plans.",
    "Personal service manager": "Replace '_' with a one-word pronoun:. The personal service manager arranged client appointments. _ ensured all services were delivered smoothly.",
    "Manager, all other": "Replace '_' with a one-word pronoun:. The manager supervised the team. _ ensured that all tasks were completed on time.",
    "Agent and business manager of artists, performers, and athletes": "Replace '_' with a one-word pronoun:. The agent secured a new deal for the performer. _ negotiated favorable terms.",
    "Buyer and purchasing agent": "Replace '_' with a one-word pronoun:. The buyer evaluated new products. _ selected the most cost-effective options.",
    "Claims adjuster": "Replace '_' with a one-word pronoun:. The claims adjuster inspected the damage. _ prepared a detailed report for the insurance company.",
    "Compliance officer": "Replace '_' with a one-word pronoun:. The compliance officer reviewed company policies. _ ensured they met legal regulations.",
    "Cost estimator": "Replace '_' with a one-word pronoun:. The cost estimator assessed the project budget. _ provided a breakdown to the client.",
    "Human resources worker": "Replace '_' with a one-word pronoun:. The human resources worker managed employee records. _ processed requests efficiently.",
    "Training and development specialist": "Replace '_' with a one-word pronoun:. The training specialist conducted an onboarding session. _ guided the new hires through the process.",
    "Logistician": "Replace '_' with a one-word pronoun:. The logistician planned the distribution route. _ ensured timely deliveries.",
    "Project management specialist": "Replace '_' with a one-word pronoun:. The project management specialist created a project timeline. _ assigned tasks to the team.",
    "Management analyst": "Replace '_' with a one-word pronoun:. The management analyst evaluated the company’s operations. _ recommended improvements to increase efficiency.",
    "Market research analyst": "Replace '_' with a one-word pronoun:. The market research analyst gathered consumer data. _ identified new trends in the industry.",
    "Accountant": "Replace '_' with a one-word pronoun:. The accountant prepared the financial statements. _ ensured accuracy before submission.",
    "Financial examiner": "Replace '_' with a one-word pronoun:. The financial examiner reviewed the bank’s transactions. _ ensured compliance with regulations.",
    "Actuary": "Replace '_' with a one-word pronoun:. The actuary calculated the financial risks. _ presented a detailed analysis to the client.",
    "Software developer": "Replace '_' with a one-word pronoun:. The software developer wrote new code for the application. _ tested it for bugs before release.",
    "Architect": "Replace '_' with a one-word pronoun:. The architect designed the new building. _ considered both functionality and aesthetics.",
    "Civil engineer": "Replace '_' with a one-word pronoun:. The civil engineer inspected the construction site. _ made sure all safety protocols were followed.",
    "Electrician": "Replace '_' with a one-word pronoun:. The electrician fixed the wiring. _ ensured everything was working safely.",
    "Dentist": "Replace '_' with a one-word pronoun:. The dentist greeted the patient. _ explained the procedure clearly.",
    "Pharmacist": "Replace '_' with a one-word pronoun:. The pharmacist filled the prescription. _ explained the dosage instructions to the patient.",
    "Veterinarian": "Replace '_' with a one-word pronoun:. The veterinarian examined the animal. _ provided treatment for the condition.",
    "Teacher": "Replace '_' with a one-word pronoun:. The teacher prepared the lesson plan. _ engaged the students in learning."
}
